[미디엄 참조페이지](https://medium.com/swlh/reshaping-in-pandas-with-stack-and-unstack-functions-bb169f64467d#id_token=eyJhbGciOiJSUzI1NiIsImtpZCI6ImVlYTFiMWY0MjgwN2E4Y2MxMzZhMDNhM2MxNmQyOWRiODI5NmRhZjAiLCJ0eXAiOiJKV1QifQ.eyJpc3MiOiJodHRwczovL2FjY291bnRzLmdvb2dsZS5jb20iLCJuYmYiOjE2MTE2MTM2NTksImF1ZCI6IjIxNjI5NjAzNTgzNC1rMWs2cWUwNjBzMnRwMmEyamFtNGxqZGNtczAwc3R0Zy5hcHBzLmdvb2dsZXVzZXJjb250ZW50LmNvbSIsInN1YiI6IjExNDg0MDQyODcwOTI3NjI2NTYwMiIsImVtYWlsIjoiZWhkYWxzMTMyM0BnbWFpbC5jb20iLCJlbWFpbF92ZXJpZmllZCI6dHJ1ZSwiYXpwIjoiMjE2Mjk2MDM1ODM0LWsxazZxZTA2MHMydHAyYTJqYW00bGpkY21zMDBzdHRnLmFwcHMuZ29vZ2xldXNlcmNvbnRlbnQuY29tIiwibmFtZSI6IkRPTkdNSU4gQ0hPIiwicGljdHVyZSI6Imh0dHBzOi8vbGgzLmdvb2dsZXVzZXJjb250ZW50LmNvbS9hLS9BT2gxNEdoS3lYdEQ4QUhndEtDQi1iRC02Q3I1Wnh3MlZQOV9QMXNrT3FqeW5BPXM5Ni1jIiwiZ2l2ZW5fbmFtZSI6IkRPTkdNSU4iLCJmYW1pbHlfbmFtZSI6IkNITyIsImlhdCI6MTYxMTYxMzk1OSwiZXhwIjoxNjExNjE3NTU5LCJqdGkiOiI3Yjk1ODBhMjVkOWQ3YzMwMzNkNzc2YWU2ZmQyYWFjZGJmMGJiZTNjIn0.EFXyI2pj8w4lpglSwcAUpwbkIs5zuVunTmOTsOZ-Z2mNpr_VP-Wra1Trj-nmRg6WlOyk-U7D47_iJ-aAGcMBUxa_PNoCcc7ZRfcexhfoWbyP5m0Stg3vZOY-aPoU6vq1RmUJvySkiFYxmQtdfz01X9N4C9MZv10HDQcaom3BWHIe18GdvjTUqgDUYEQmGiJGMDKT6zjD1FmcCuhP68pd2ov0LGRoZw1xtmDKyuHbN3uMHo-zIZr6STPRmQkZ63kbQvNaltid_NDXr7pwRGHhbUiTy4wHtYcjjDq2dTszNInkqraN4kAuT1Uk1Np57zPX4UaU17h3X6zGNzqsjzRkQg)

[판다스공홈](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.stack.html)

**요약**

* Stack : Column을 Row로 펴는것
* Unstack : Row를 Column으로 펴는 것

In [2]:
import numpy as np
import pandas as pd

# Stack

## Single Index

In [3]:
sample = pd.DataFrame([['동민', '철수', '영희'], [176, 173, 160]],
                     index=['이름', '키'], columns=['조', '김', '이'])
sample

      조    김    이
이름   동민   철수   영희
키   176  173  160

stack!

In [5]:
sample.stack().reset_index()

  level_0 level_1    0
0      이름       조   동민
1      이름       김   철수
2      이름       이   영희
3       키       조  176
4       키       김  173
5       키       이  160

## Multi Index

In [8]:
#lv0의 컬럼 이름이 달라야지 다르게 남는다.
col_lv2 = pd.MultiIndex.from_tuples([('돈1', '달러'), ('돈2', '원화')])

In [9]:
sample_lv2 = pd.DataFrame([[10, 11000], ['동민', '철수']], index=['금액', '이름']
                          ,columns=col_lv2)
sample_lv2

    돈1     돈2
    달러     원화
금액  10  11000
이름  동민     철수

In [10]:
sample_lv2.stack().reset_index()

  level_0 level_1   돈1     돈2
0      금액      달러   10    NaN
1      금액      원화  NaN  11000
2      이름      달러   동민    NaN
3      이름      원화  NaN     철수

In [11]:
sample_lv2.stack().stack().reset_index()

  level_0 level_1 level_2      0
0      금액      달러      돈1     10
1      금액      원화      돈2  11000
2      이름      달러      돈1     동민
3      이름      원화      돈2     철수

* stack을 할때마다 가장 위 열부터 아래로 차례로 내려온다.

* 이어서.. 스택내부 파라미터부터